{"_id":{"$oid":"624a2c0246eba9e74ec9b8e2"},"Title":"Spider-Man: No Way Home","Description":" With Spider-Man's identity now revealed, our freiendly neighbourhood web-slinger is unmasked and no longer able to seperate his normal life as Peter Parker from the high stakes of being a superhero. When Peter asks for helps from Doctor Strange, the stakes become even more dangerous, forcing him to discover what it truly means to be Spider-Man.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist is thrust into a eries of events that typically involve violence and physical feats."},"Director":{"Name":"Jon Watts","Bio":"Jon Watts is an American filmmaker and screenwriter.","Birth":"June 28, 1981"},"ImagePath":"imbd.com/title/tt10872600/","Featured":false}
{"_id":{"$oid":"624adffe059e527612c62ed0"},"Title":"Spider-Man: Homecoming","Description":" Thrilled by his experince with the Avengers, young Peter Parker returns home to live with his Aunty May. Under the watchful eye of mentor Tony Stark, Parker starts to embrace his new found identity as Spider-Man. He tries to return to his normal daily routine distracted by thoughts of proving himself to be more than just a friendly neighbourhood superhero. Peter must soon put his powers to test when evil Vulture emerges to threaten everything that he holds dear.","Genre":{"Name":"Action","Description":"Action film is a film genre in which protagonist is thrust into a series of events that typically involve violence and physical feats."},"Director":{"Name":"Jon Watts","Bio":"Jon Watts is an American filmmaker and screenwriter.","Birth":"June 28, 1981"},"ImagePath":"imbd.com/title/tt2250912/","Featured":false}
{"_id":{"$oid":"624ce3937c2dc5d98dabdd1e"},"Title":"Finding Dory","Description":"Dory is a wide-eyed, blue tang fish who suffers from memory loss every 10 seconds or so. The one thing she can remember is that she somehow became seperated from her parent as a child. When help from her friends Nemo and Marlin, Dory embarks on an epic adventure to find them. Her journey brings her to the Marine Life Institute, a conservatory that houses diverse ocean species. Dory now knows that her family reunion will only happen if she can save mom and dad from captivity.","Genre":{"Name":"Animation","Description":"Animated films as a genre in which the film's images are primarily created by computer or hand and the characters are voiced by actors. A skillful combination of caricature and artistry, animation amplifies relaity, offering stories that are visually stylized, but emotionally truthful."},"Director":{"Name":"Andrew Stanton","Bio":"Andrew Ayers Stanton is an American animator, storyboard artist, film director, screenwriter, producer and voice actor based at Pixar, which he joined in 1990.","Birth":"December 3, 1965"},"ImagePath":"https://www.imdb.com/title/tt2277860/","Featured":false}
{"_id":{"$oid":"624cec7a7c2dc5d98dabdd1f"},"Title":"Finding Nemo","Description":"Marlin, a clown fish, is overly cautious with his son, Nemo, who has a foreshortened fin. hen nemo swims too close to the surface to prove himslef, he is caught by a diver, and horrified Marlin must set out to find him. A blue reef fish named Dory who has a really short memory joins Marlin and complicates the encounters with sharks, jellyfish, and a host of ocean dangers. Meanwhile, Nemo plots his escape from a dentist's fish tank.","Genre":{"Name":"Animation","Description":"Animated films as a genre in which the film's images are primarily created by computer or hand and the characters are voiced by actors. A skillful combination of caricature and artistry, animation amplifies relaity, offering stories that are visually stylized, but emotionally truthful."},"Director":{"Name":"Andrew Stanton","Bio":"Andrew Ayers Stanton is an American animator, storyboard artist, film director, screenwriter, producer and voice actor based at Pixar, which he joined in 1990.","Birth":"December 3, 1965"},"ImagePath":"https://www.imdb.com/title/tt0266543/","Featured":false}
{"_id":{"$oid":"624cfc257c2dc5d98dabdd20"},"Title":"Bridesmaids","Description":"Annie is a single woman whose own life is a mess, but when she learns that her lifelong best friend, Lillian is engaged, she has no choice but to serve as the maid of honor. Though lovelorn and almost penniless, Annie, nevertheless, winds her way through the strange and expensive rituals associated with their job as the bride's go-to gal. Determined to make things perfect, she gamely leads Lillian and the other bridesmaids down the wild road to the wedding.","Genre":{"Name":"Comedy","Description":"Comedy films are designed to elicit laughter from the audience. Comedies are light-hearted dramas, crafted to amuse, entertain, and provoke enjoyment. The comedy genre humorously exaggerates the situation, the language, action, and characters."},"Director":{"Name":"Paul Feig","Bio":"Paul Samuel Feig is an American actor, comedian and filmmaker.","Birth":"September 17, 1962"},"ImagePath":"https://www.imdb.com/title/tt1478338/","Featured":false}
{"_id":{"$oid":"624cffe07c2dc5d98dabdd21"},"Title":"Identity Theif","Description":"Florida resident Diana has a luxurious lifestyle as the queen of retail, buying whatever strikes her fancy and it's all free, thanks to Sandy Patterson, a guy from Denver whose identity she stole. With just one week to track down Diana before his world implodes, the real Sandy heads South to confront the unapologetic con artist and bring her back to Denver so that he can clear his name and restore his shattered credit rating.","Genre":{"Name":"Comedy","Description":"Comedy films are designed to elicit laughter from the audience. Comedies are light-hearted dramas, crafted to amuse, entertain, and provoke enjoyment. The comedy genre humorously exaggerates the situation, the language, action, and characters."},"Director":{"Name":"Paul Feig","Bio":"Paul Samuel Feig is an American actor, comedian and filmmaker.","Birth":"September 17, 1962"},"ImagePath":"https://www.imdb.com/title/tt2024432/","Featured":false}
{"_id":{"$oid":"624e01f7a541f357b266d2f0"},"Title":"Crazy Rich Asians","Description":"Rachel Chu is happy to accompany her long time boyfriend, Nick, to his best friend's wedding in Singapore. She's also surprised to learn Nick's family is extremely wealthy, and he's considered one of the country's most eligible bachelors. Thrust into the spotlight, rachel must now contend with jealous socialities, quirky relatives and something far, far worse Nick's disapproving mother.","Genre":{"Name":"Romance","Description":"Romance film can be defined as a genre wherein the plot revolves around the love between two protagonists. This genre usually has a theme that explores an issue within love, including but not limited to: love at first sight, forbidden love, love triangles, and sacrificial love."},"Director":{"Name":" Jon M. Chu","Bio":"Jonathan Murray Chu is an American film director, producer, and screenwriter.","Birth":"November 2, 1979"},"ImagePath":"https://www.imdb.com/title/tt3104988/","Featured":false}
{"_id":{"$oid":"624e0479a541f357b266d2f1"},"Title":"Little Women","Description":"In the years after the Civil War, Jo March lives in New York amd makes her living as a writer, while her sister Amy studies painting in Paris. Amy has a chance encounter with Theodore, a childhood crush who proposed to Jo but was ultimately rejected. Their oldest sibling, Meg, is married to a schoolteacher, while shy sister Beth develops a devestating illness that brings the family back together.","Genre":{"Name":"Romance","Description":"Romance film can be defined as a genre wherein the plot revolves around the love between two protagonists. This genre usually has a theme that explores an issue within love, including but not limited to: love at first sight, forbidden love, love triangles, and sacrificial love."},"Director":{"Name":"Greta Gerwig","Bio":" Greta Celeste Gerwig is an American actress, writer, and director.","Birth":"August 4, 1983"},"ImagePath":"https://www.imdb.com/title/tt3281548/","Featured":false}
{"_id":{"$oid":"624eef63d390972992058d9d"},"Title":"Mulan","Description":"To keep her ailing father from serving in the imperial Army, a fearless young woman disguises herself as a man and battles northern invaders in China.","Genre":{"Name":"Fantasy","Description":"Fantasy Films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds."},"Director":{"Name":"Niki Caro","Bio":"Nikola Jean Caro MNZM is a New Zealand film director and screenwriter.","Birth":"September 20, 1966"},"ImagePath":"https://www.imdb.com/title/tt4566758/","Featured":false}
{"_id":{"$oid":"624ef3ced390972992058d9e"},"Title":"Aladdin","Description":"Aladdin is a lovable street urchin who meets Princess Jasmine, the beautiful daughter of the sultan of Agrabah. While visiting her exotic palace, Aladdin stumbles upon a magic oil lamp that unleashes a powerful, wisecracking, larger-than-life genie start to become friends, they must soon embark on a dangerous mission to stop the evil sorcerer, Jafar, from overthrowing young Jasmine's kingdom.","Genre":{"Name":"Fantasy","Description":"Fantasy Films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds."},"Director":{"Name":"Guy Ritchie","Description":"Guy Stuart Ritchie is an English film director, producer, screenwriter and businessman.","Birth":"September 10, 1968"},"ImagePath":"https://www.imdb.com/title/tt6139732/","Featured":false}
